[
    {
        "id_battle": 1,
        "name_class": "DeathKnight",
        "img_class": "deathknight.jpg",
        "description": "Death Knights engage their foes up-close, supplementing swings of their weapons with dark magic that renders enemies vulnerable or damages them with unholy power. They drag foes into one-on-one conflicts, compelling them to focus their attacks away from weaker companions. To prevent their enemies from fleeing their grasp, death knights must remain mindful of the power they call forth from runes, and pace their attacks appropriately.",
        "ability1": "Blood Shield",
        "ability2": "Frozen Heart",
        "ability3": "Dreadblade",
        "health": 1890,
        "armor": 945,
        "offense": 540,
        "defense": 344,
        "speed": 140,
        "color": "#C41E3A"
    },
    {
        "id_battle": 2,
        "name_class": "DemonHunter",
        "img_class": "demonhunter.jpg",
        "description": "Forgoing heavy armor, Demon Hunters capitalize on speed, closing the distance quickly to strike enemies with one-handed weapons. However, Illidari must also use their agility defensively to ensure that battles end favorably.",
        "ability1": "Demonic Presence",
        "ability2": "Fel Blood",
        "ability3": "Legion",
        "health": 1890,
        "armor": 473,
        "offense": 540,
        "defense": 344,
        "speed": 260,
        "color": "#A330C9"
    },
    {
        "id_battle": 3,
        "name_class": "Druid",
        "img_class": "druid.jpg",
        "description": "Druids harness the vast powers of nature to preserve balance and protect life. With experience, druids can unleash nature’s raw energy against their enemies, raining celestial fury on them from a great distance, binding them with enchanted vines, or ensnaring them in unrelenting cyclones.",
        "ability1": "Total Razor Eclipse Claws",
        "ability2": "Nature's Guardian",
        "ability3": "Harmony",
        "health": 1890,
        "armor": 473,
        "offense": 540,
        "defense": 420,
        "speed": 220,
        "color": "#FF7C0A"
    },
    {
        "id_battle": 4,
        "name_class": "Hunter",
        "img_class": "hunter.jpg",
        "description": "From an early age the call of the wild draws some adventurers from the comfort of their homes into the unforgiving primal world outside. Those who endure become hunters. Masters of their environment, they are able to slip like ghosts through the trees and lay traps in the paths of their enemies.",
        "ability1": "Master of Beasts",
        "ability2": "Sniper Training",
        "ability3": "Spirit Bond",
        "health": 1890,
        "armor": 630,
        "offense": 756,
        "defense": 189,
        "speed": 230,
        "color": "#AAD372"
    },
    {
        "id_battle": 5,
        "name_class": "Mage",
        "img_class": "mage.jpg",
        "description": "Students gifted with a keen intellect and unwavering discipline may walk the path of the mage. The arcane magic available to magi is both great and dangerous, and thus is revealed only to the most devoted practitioners. To avoid interference with their spellcasting, magi wear only cloth armor, but arcane shields and enchantments give them additional protection. To keep enemies at bay, magi can summon bursts of fire to incinerate distant targets and cause entire areas to erupt, setting groups of foes ablaze.",
        "ability1": "Savant",
        "ability2": "Ignite",
        "ability3": "Icicles",
        "health": 1890,
        "armor": 378,
        "offense": 756,
        "defense": 189,
        "speed": 190,
        "color": "#3FC7EB"
    },
    {
        "id_battle": 6,
        "name_class": "Monk",
        "img_class": "monk.jpg",
        "description": "When the pandaren were subjugated by the mogu centuries ago, it was the monks that brought hope to a seemingly dim future. Restricted from using weapons by their slave masters, these pandaren instead focused on harnessing their chi and learning weaponless combat. When the opportunity for revolution struck, they were well-trained to throw off the yoke of oppression.",
        "ability1": "Elusive Brawler",
        "ability2": "Gust of Mists",
        "ability3": "Combo Strikes",
        "health": 1890,
        "armor": 473,
        "offense": 540,
        "defense": 420,
        "speed": 250,
        "color": "#00FF98"
    },
    {
        "id_battle": 7,
        "name_class": "Paladin",
        "img_class": "paladin.jpg",
        "description": "This is the call of the paladin: to protect the weak, to bring justice to the unjust, and to vanquish evil from the darkest corners of the world. These holy warriors are equipped with plate armor so they can confront the toughest of foes, and the blessing of the Light allows them to heal wounds and, in some cases, even restore life to the dead.",
        "ability1": "Lightbringer",
        "ability2": "Divine Bulwark",
        "ability3": "Hand of Light",
        "health": 1890,
        "armor": 945,
        "offense": 540,
        "defense": 420,
        "speed": 180,
        "color": "#F48CBA"
    },
    {
        "id_battle": 8,
        "name_class": "Priest",
        "img_class": "priest.jpg",
        "description": "Priests are devoted to the spiritual, and express their unwavering faith by serving the people. For millennia they have left behind the confines of their temples and the comfort of their shrines so they can support their allies in war-torn lands. In the midst of terrible conflict, no hero questions the value of the priestly orders.",
        "ability1": "Grace",
        "ability2": "Echo of Light",
        "ability3": "Shadow Weaving",
        "health": 1890,
        "armor": 378,
        "offense": 540,
        "defense": 344,
        "speed": 170,
        "color": "#FFFFFF"
    },
    {
        "id_battle": 9,
        "name_class": "Rogue",
        "img_class": "rogue.jpg",
        "description": "For rogues, the only code is the contract, and their honor is purchased in gold. Free from the constraints of a conscience, these mercenaries rely on brutal and efficient tactics. Lethal assassins and masters of stealth, they will approach their marks from behind, piercing a vital organ and vanishing into the shadows before the victim hits the ground.",
        "ability1": "Potent Assassin",
        "ability2": "Main Gauche",
        "ability3": "Executioner",
        "health": 1890,
        "armor": 473,
        "offense": 756,
        "defense": 189,
        "speed": 240,
        "color": "#FFF468"
    },
    {
        "id_battle": 10,
        "name_class": "Shaman",
        "img_class": "shaman.jpg",
        "description": "Shaman are spiritual guides and practitioners, not of the divine, but of the very elements. Unlike some other mystics, shaman commune with forces that are not strictly benevolent. The elements are chaotic, and left to their own devices, they rage against one another in unending primal fury. It is the call of the shaman to bring balance to this chaos. Acting as moderators among earth, fire, water, and air, shaman summon totems that focus the elements to support the shaman’s allies or punish those who threaten them.",
        "ability1": "Elemental Overload",
        "ability2": "Enhanced Elements",
        "ability3": "Deep Healing",
        "health": 1890,
        "armor": 630,
        "offense": 540,
        "defense": 344,
        "speed": 210,
        "color": "#0070DD"
    },
    {
        "id_battle": 11,
        "name_class": "Warlock",
        "img_class": "warlock.jpg",
        "description": "In the face of demonic power, most heroes see death. Warlocks see only opportunity. Dominance is their aim, and they have found a path to it in the dark arts. These voracious spellcasters summon demonic minions to fight beside them. At first, they command only the service of imps, but as a warlock’s knowledge grows, seductive succubi, loyal voidwalkers, and horrific felhunters join the dark sorcerer’s ranks to wreak havoc on anyone who stands in their master’s way.",
        "ability1": "Potent Afflictions",
        "ability2": "Master Demonologist",
        "ability3": "Chaotic Energies",
        "health": 1890,
        "armor": 378,
        "offense": 756,
        "defense": 189,
        "speed": 150,
        "color": "#8788EE"
    },
    {
        "id_battle": 12,
        "name_class": "Warrior",
        "img_class": "warrior.jpg",
        "description": "For as long as war has raged, heroes from every race have aimed to master the art of battle. Warriors combine strength, leadership, and a vast knowledge of arms and armor to wreak havoc in glorious combat. Some protect from the front lines with shields, locking down enemies while allies support the warrior from behind with spell and bow. Others forgo the shield and unleash their rage at the closest threat with a variety of deadly weapons.",
        "ability1": "Deep Wounds",
        "ability2": "Unshackled Fury",
        "ability3": "Critical Block",
        "health": 1890,
        "armor": 945,
        "offense": 540,
        "defense": 344,
        "speed": 160,
        "color": "#C69B6D"
    },
    {
        "id_battle": 13,
        "name_class": "Evoker",
        "img_class": "evoker.jpg",
        "description": "Every dracthyr is an expert soldier. Whatever weyrn they serve, they use their talents to defend dragonkind in obedience to the Earth-Warder. Yet even among such illustrious ranks, there are a select few who transcend the skills of their kin. Who are able to master the specialties of all weyrns and shift between roles at will. These are the evokers. The best of the best, finest of the finest.",
        "ability1": "Giantkiller",
        "ability2": "Life-Binder",
        "ability3": "Dragonflight",
        "health": 1890,
        "armor": 630,
        "offense": 540,
        "defense": 344,
        "speed": 200,
        "color": "#33937F"
    }
]